pasandoNotasDeMoodleaGEA.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2026-02-25 mié 13:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Código Python para Transferir las Notas de Moodle a las Actas de GEA</title>
<meta name="author" content="Marcos Bujosa" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Código Python para Transferir las Notas de Moodle a las Actas de GEA</h1>
<div id="outline-container-orga3d4105" class="outline-2">
<h2 id="orga3d4105"><span class="section-number-2">1.</span> Código en Python</h2>
<div class="outline-text-2" id="text-1">
<p>
La función <code>de_Moodle_a_actas</code> utiliza el módulo <code>pandas</code>.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #0000FF; font-weight: bold;">import</span> pandas <span style="color: #0000FF; font-weight: bold;">as</span> pd
</pre>
</div>

<p>
A continuación, se presenta el código de la función:
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #0000FF; font-weight: bold;">def</span> <span style="color: #006699;">de_Moodle_a_actas</span>(excelMoodle: <span style="color: #006FE0;">str</span>, excelActas: <span style="color: #006FE0;">str</span>, nombre_columna_con_las_calificaciones: <span style="color: #006FE0;">str</span>):
    <span style="color: #036A07;">"""Funci&#243;n que cumplimenta una copia de las actas descargadas del portal de
    gesti&#243;n acad&#233;mica con las notas calculadas en Moodle y almacenadas en un
    archivo Excel descargado desde Moodle.

    excelMoodle: nombre (incluido el path) del archivo descargado desde Moodle
    excelActas:  nombre (incluido el path) del archivo de actas descargado desde GEA
    nombre_columna_con_las_calificaciones: nombre de la columna del archivo excelMoodle donde est&#225;n las notas finales
    """</span>
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Cargar los datos
</span>    <span style="color: #BA36A5;">df_moodle</span> = pd.read_excel(excelMoodle)  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Excel descargado de Moodle
</span>    <span style="color: #BA36A5;">df_gea</span> = pd.read_excel(excelActas)      <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Excel de las actas (vac&#237;as) descargado de la p&#225;gina de calificaci&#243;n de actas (con extensi&#243;n .xls).
</span>
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Limpia el DNI en el df_moodle para que no contenga la letra final
</span>    <span style="color: #BA36A5;">df_moodle</span>[<span style="color: #008000;">'DNI_sin_letra'</span>] = df_moodle[<span style="color: #008000;">'N&#250;mero de ID'</span>].<span style="color: #006FE0;">str</span>[:-1]

    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Mantiene los ceros a la izquierda en el df_moodle
</span>    <span style="color: #BA36A5;">df_moodle</span>[<span style="color: #008000;">'DNI_sin_letra'</span>] = df_moodle[<span style="color: #008000;">'DNI_sin_letra'</span>].<span style="color: #006FE0;">str</span>.zfill(8)

    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Mantiene los ceros a la izquierda en el df_gea
</span>    <span style="color: #BA36A5;">df_gea</span>[<span style="color: #008000;">'Doc. de identidad'</span>] = df_gea[<span style="color: #008000;">'Doc. de identidad'</span>].astype(<span style="color: #006FE0;">str</span>).<span style="color: #006FE0;">str</span>.zfill(8)

    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Realiza el merge (uni&#243;n) entre los dos DataFrames
</span>    <span style="color: #BA36A5;">merged_df</span> = pd.merge(df_gea, 
                         df_moodle[[<span style="color: #008000;">'DNI_sin_letra'</span>, nombre_columna_con_las_calificaciones]],
                         left_on=<span style="color: #008000;">'Doc. de identidad'</span>, 
                         right_on=<span style="color: #008000;">'DNI_sin_letra'</span>, 
                         how=<span style="color: #008000;">'left'</span>)

    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Rellena la columna 'Nota num.' con las notas de la columna correspondiente en df_moodle y reemplaza '-' por vac&#237;os
</span>    <span style="color: #BA36A5;">df_gea</span>[<span style="color: #008000;">'Nota num.'</span>] = merged_df[nombre_columna_con_las_calificaciones].replace(<span style="color: #008000;">'-'</span>, <span style="color: #008000;">''</span>)

    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Asegura que los NaN en 'Calificaci&#243;n' del DataFrame de GEA se mantengan como vac&#237;os
</span>    <span style="color: #BA36A5;">df_gea</span>[<span style="color: #008000;">'Calificaci&#243;n'</span>] = df_gea[<span style="color: #008000;">'Calificaci&#243;n'</span>].where(df_gea[<span style="color: #008000;">'Calificaci&#243;n'</span>].notna(), <span style="color: #008000;">''</span>)

    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Devuelve el DataFrame
</span>    <span style="color: #0000FF; font-weight: bold;">return</span> df_gea
</pre>
</div>

<p>
Este código lee el archivo de Moodle y el archivo de las actas, identifica a los alumnos de ambos ficheros por el DNI y "pasa a actas" las notas de la columna que se especifique (que contiene las calificaciones finales). La función devuelve un DataFrame con la estructura del archivo de actas que incorpora las calificaciones de cada alumno.
</p>
</div>
</div>
<div id="outline-container-orgb0d3e1f" class="outline-2">
<h2 id="orgb0d3e1f"><span class="section-number-2">2.</span> Cómo usarlo</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org70c517b" class="outline-3">
<h3 id="org70c517b"><span class="section-number-3">2.1.</span> Paso previo</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Desde <a href="https://geaportal.ucm.es/index.html">https://geaportal.ucm.es/index.html</a>, en <i>Calificación de actas</i>, descarga un archivo Excel con las actas vacías del grupo que se va a calificar. 
(Dado que GEA siempre designa estos archivos como <code>CalificacionExcel.xls</code>, se recomienda guardarlos en un subdirectorio diferente para cada grupo).</li>
<li>Descarga las calificaciones desde Moodle en un archivo Excel, por ejemplo <code>00-123456-Calificaciones.xlsx</code>. 
(Es aconsejable guardar este archivo en el mismo directorio donde se han almacenado las actas del grupo correspondiente).</li>
</ul>
</div>
</div>
<div id="outline-container-org1b1045c" class="outline-3">
<h3 id="org1b1045c"><span class="section-number-3">2.2.</span> Ejecución de la función</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><p>
Ejecuta 
</p>
<div class="org-src-container">
<pre class="src src-python">de_Moodle_a_actas(<span style="color: #008000;">'path/ExcelDescargadoDesdeMoodle.xlsx'</span>, <span style="color: #008000;">'path/CalificacionExcel.xls'</span>, <span style="color: #008000;">'CabeceraColumnaConLasNotas'</span>)
</pre>
</div>
<p>
donde <code>CalificacionExcel.xls</code> es el archivo con las actas descargadas desde <a href="https://geaportal.ucm.es/index.html">https://geaportal.ucm.es/index.html</a>.
</p></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4026989" class="outline-2">
<h2 id="org4026989"><span class="section-number-2">3.</span> Ejemplo de uso</h2>
<div class="outline-text-2" id="text-3">
<p>
Supongamos que el archivo descargado desde Moodle es <code>./GrupoAlpha/00-123456-Calificaciones.xlsx</code> (donde <code>./GrupoAlpha/</code> es la ruta hasta el archivo). Y que las calificaciones finales que se van a pasar a actas se encuentran en la columna con la cabecera <code>Total ConvocatoriaOrdinaria (Real)</code>. 
</p>

<p>
Además, el archivo con las actas sin cumplimentar es <code>./GrupoAlpha/CalificacionExcel.xls</code>. Entonces, basta con ejecutar lo siguiente:
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Uso de la funci&#243;n
</span><span style="color: #BA36A5;">notasConvocatoriaOrdinariaGrupoAlpha</span> = de_Moodle_a_actas(<span style="color: #008000;">'./GrupoAlpha/00-123456-Calificaciones.xlsx'</span>,
                                                     <span style="color: #008000;">'./GrupoAlpha/CalificacionExcel.xls'</span>,
                                                     <span style="color: #008000;">'Total ConvocatoriaOrdinaria (Real)'</span>)
</pre>
</div>
<p>
donde <code>notasConvocatoriaOrdinariaGrupoAlpha</code> es el nombre del DataFrame con la estructura de las actas, que estará cumplimentado con las notas de Moodle. Para ver el resultado:
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #006FE0;">print</span>(notasConvocatoriaOrdinariaGrupoAlpha)
</pre>
</div>

<p>
Para guardar el DataFrame en un archivo Excel, se recomienda utilizar un nombre descriptivo (de esta manera se evitarán confusiones al subirlo a <a href="https://geaportal.ucm.es">https://geaportal.ucm.es</a>).
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #BA36A5;">nombreFichero</span> = <span style="color: #008000;">'actaOrdinariaGrupoAlpha'</span>
notasConvocatoriaOrdinariaGrupoAlpha.to_excel(nombreFichero + <span style="color: #008000;">'.xlsx'</span>, index=<span style="color: #D0372D;">False</span>)  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Guarda el DataFrame en un archivo Excel
</span><span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"El archivo Excel </span>{nombreFichero}<span style="color: #008000;">.xlsx se ha guardado correctamente."</span>)
</pre>
</div>

<pre class="example">
El archivo Excel actaOrdinariaGrupoAlpha.xlsx se ha guardado correctamente.
</pre>


<p>
El archivo Excel que hemos creado se puede cargar en la página donde se cumplimentan las actas (haciendo clic en el enlace <span class="underline">"Cargar/descargar fichero Excel"</span>).
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Marcos Bujosa</p>
<p class="date">Created: 2026-02-25 mié 13:22</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
